@radekwroblewski I am able to make a plan like below. Tried the latest version of google-beta

```tf
  # google_compute_instance_group_manager.appserver will be created
  + resource "google_compute_instance_group_manager" "appserver" {
      + base_instance_name             = "app"
      + fingerprint                    = (known after apply)
      + id                             = (known after apply)
      + instance_group                 = (known after apply)
      + list_managed_instances_results = "PAGELESS"
      + name                           = "issue13961"
      + operation                      = (known after apply)
      + project                        = (known after apply)
      + self_link                      = (known after apply)
      + status                         = (known after apply)
      + target_size                    = 5
      + wait_for_instances             = false
      + wait_for_instances_status      = "STABLE"
      + zone                           = "us-central1-a"

      + instance_lifecycle_policy {
          + force_update_on_repair = (known after apply)
        }

      + stateful_internal_ip {.      <-------here
          + delete_rule = "NEVER"
        }

      + update_policy {
          + max_surge_fixed                = (known after apply)
          + max_surge_percent              = (known after apply)
          + max_unavailable_fixed          = (known after apply)
          + max_unavailable_percent        = (known after apply)
          + min_ready_sec                  = (known after apply)
          + minimal_action                 = (known after apply)
          + most_disruptive_allowed_action = (known after apply)
          + replacement_method             = (known after apply)
          + type                           = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
          + name              = "appserver"
        }
    }
```